; domain
(define (domain satellite)
  (:requirements :typing :fluents :equality)
 (:types satellite direction instrument mode)
 (:predicates 
               (on_board ?i - instrument ?s - satellite)
	       (supports ?i - instrument ?m - mode)
	       (pointing ?s - satellite ?d - direction)
	       (power_avail ?s - satellite)
	       (power_on ?i - instrument)
	       (calibrated ?i - instrument)
	       (have_image ?d - direction ?m - mode)
	       (calibration_target ?i - instrument ?d - direction))
 
 

  (:functions (data_capacity ?s - satellite)
	      (data ?d - direction ?m - mode)
		(slew_time ?a ?b - direction)
		(data-stored)
		(fuel ?s - satellite)
		(fuel-used)
  )

  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev)
                   (not (= ?d_new ?d_prev))
		(>= (fuel ?s) (slew_time ?d_new ?d_prev))
              )
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))
		(decrease (fuel ?s) (slew_time ?d_new ?d_prev))
		(increase (fuel-used) (slew_time ?d_new ?d_prev))
           )
  )

 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
 
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s)
                 )
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))
           )
          
  )

 
  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
 
   :precondition (and (on_board ?i ?s)
                      (power_on ?i) 
                  )
   :effect (and (not (power_on ?i))
                (power_avail ?s)
           )
  )

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i)
                  )
   :effect (calibrated ?i)
  )
 

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d)
                      (power_on ?i)
			  (>= (data_capacity ?s) (data ?d ?m))
               )
   :effect (and (decrease (data_capacity ?s) (data ?d ?m)) (have_image ?d ?m)
		(increase (data-stored) (data ?d ?m)))
  )
)

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	infrared1 - mode
	infrared2 - mode
	thermograph0 - mode
	Star0 - direction
	Star2 - direction
	Star1 - direction
	Planet3 - direction
	Star4 - direction
	Phenomenon5 - direction
	Star6 - direction
	Phenomenon7 - direction
)
(:init
	(supports instrument0 thermograph0)
	(calibration_target instrument0 Star1)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star6)
	(= (data_capacity satellite0) 1000)
	(= (fuel satellite0) 149)
	(= (data Planet3 infrared1) 276)
	(= (data Star4 infrared1) 199)
	(= (data Phenomenon5 infrared1) 87)
	(= (data Star6 infrared1) 142)
	(= (data Phenomenon7 infrared1) 84)
	(= (data Planet3 infrared2) 105)
	(= (data Star4 infrared2) 184)
	(= (data Phenomenon5 infrared2) 213)
	(= (data Star6 infrared2) 63)
	(= (data Phenomenon7 infrared2) 77)
	(= (data Planet3 thermograph0) 225)
	(= (data Star4 thermograph0) 264)
	(= (data Phenomenon5 thermograph0) 245)
	(= (data Star6 thermograph0) 198)
	(= (data Phenomenon7 thermograph0) 7)
	(= (slew_time Star2 Star0) 45.97)
	(= (slew_time Star0 Star2) 45.97)
	(= (slew_time Star2 Star1) 19.71)
	(= (slew_time Star1 Star2) 19.71)
	(= (slew_time Star1 Star0) 14.59)
	(= (slew_time Star0 Star1) 14.59)
	(= (slew_time Planet3 Star0) 9.948)
	(= (slew_time Star0 Planet3) 9.948)
	(= (slew_time Planet3 Star1) 62.98)
	(= (slew_time Star1 Planet3) 62.98)
	(= (slew_time Planet3 Star2) 67.23)
	(= (slew_time Star2 Planet3) 67.23)
	(= (slew_time Star4 Star0) 8.357)
	(= (slew_time Star0 Star4) 8.357)
	(= (slew_time Star4 Star1) 41.72)
	(= (slew_time Star1 Star4) 41.72)
	(= (slew_time Star4 Star2) 20.45)
	(= (slew_time Star2 Star4) 20.45)
	(= (slew_time Star4 Planet3) 59.62)
	(= (slew_time Planet3 Star4) 59.62)
	(= (slew_time Phenomenon5 Star0) 1.816)
	(= (slew_time Star0 Phenomenon5) 1.816)
	(= (slew_time Phenomenon5 Star1) 3.315)
	(= (slew_time Star1 Phenomenon5) 3.315)
	(= (slew_time Phenomenon5 Star2) 18.73)
	(= (slew_time Star2 Phenomenon5) 18.73)
	(= (slew_time Phenomenon5 Planet3) 46.65)
	(= (slew_time Planet3 Phenomenon5) 46.65)
	(= (slew_time Phenomenon5 Star4) 11.7)
	(= (slew_time Star4 Phenomenon5) 11.7)
	(= (slew_time Star6 Star0) 91.26)
	(= (slew_time Star0 Star6) 91.26)
	(= (slew_time Star6 Star1) 25.72)
	(= (slew_time Star1 Star6) 25.72)
	(= (slew_time Star6 Star2) 66.17)
	(= (slew_time Star2 Star6) 66.17)
	(= (slew_time Star6 Planet3) 37.88)
	(= (slew_time Planet3 Star6) 37.88)
	(= (slew_time Star6 Star4) 11.05)
	(= (slew_time Star4 Star6) 11.05)
	(= (slew_time Star6 Phenomenon5) 20.22)
	(= (slew_time Phenomenon5 Star6) 20.22)
	(= (slew_time Phenomenon7 Star0) 21.58)
	(= (slew_time Star0 Phenomenon7) 21.58)
	(= (slew_time Phenomenon7 Star1) 24.32)
	(= (slew_time Star1 Phenomenon7) 24.32)
	(= (slew_time Phenomenon7 Star2) 4.139)
	(= (slew_time Star2 Phenomenon7) 4.139)
	(= (slew_time Phenomenon7 Planet3) 62.52)
	(= (slew_time Planet3 Phenomenon7) 62.52)
	(= (slew_time Phenomenon7 Star4) 3.019)
	(= (slew_time Star4 Phenomenon7) 3.019)
	(= (slew_time Phenomenon7 Phenomenon5) 10.83)
	(= (slew_time Phenomenon5 Phenomenon7) 10.83)
	(= (slew_time Phenomenon7 Star6) 23.95)
	(= (slew_time Star6 Phenomenon7) 23.95)
	(= (data-stored) 0)
	(= (fuel-used) 0)
)
(:goal (and
	(have_image Planet3 thermograph0)
	(have_image Phenomenon5 thermograph0)
	(have_image Phenomenon7 thermograph0)
))
(:metric minimize (fuel-used))

)

; plan
1. (turn_to satellite0 star1 star6)
   deleted: (pointing satellite0 star6)
   added: (pointing satellite0 star1)
   changed: (fuel satellite0) from 149 to 123.28, (fuel-used) from 0 to 25.72
   goals met: 0 of 3
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 3
3. (calibrate satellite0 instrument0 star1)
   added: (calibrated instrument0)
   goals met: 0 of 3
4. (turn_to satellite0 phenomenon5 star1)
   deleted: (pointing satellite0 star1)
   added: (pointing satellite0 phenomenon5)
   changed: (fuel satellite0) from 123.28 to 119.965, (fuel-used) from 25.72 to 29.035
   goals met: 0 of 3
5. (take_image satellite0 phenomenon5 instrument0 thermograph0)
   added: (have_image phenomenon5 thermograph0)
   changed: (data_capacity satellite0) from 1000 to 755, (data-stored) from 0 to 245
   goals met: 1 of 3
6. (turn_to satellite0 planet3 phenomenon5)
   deleted: (pointing satellite0 phenomenon5)
   added: (pointing satellite0 planet3)
   changed: (fuel satellite0) from 119.965 to 73.315, (fuel-used) from 29.035 to 75.685
   goals met: 1 of 3
7. (take_image satellite0 planet3 instrument0 thermograph0)
   added: (have_image planet3 thermograph0)
   changed: (data_capacity satellite0) from 755 to 530, (data-stored) from 245 to 470
   goals met: 2 of 3
8. (turn_to satellite0 phenomenon7 planet3)
   deleted: (pointing satellite0 planet3)
   added: (pointing satellite0 phenomenon7)
   changed: (fuel satellite0) from 73.315 to 10.795, (fuel-used) from 75.685 to 138.205
   goals met: 2 of 3
9. (take_image satellite0 phenomenon7 instrument0 thermograph0)
   added: (have_image phenomenon7 thermograph0)
   changed: (data_capacity satellite0) from 530 to 523, (data-stored) from 470 to 477
   goals met: 3 of 3
